## :white_check_mark: Apply Result
[CI link](https://github.com/rindrics-sandbox-org/terraform-operations/actions/runs/11920537208)

<pre><code>Apply complete! Resources: 3 imported, 23 added, 1 changed, 0 destroyed.</code></pre>
<details><summary>Details (Click me)</summary>

```hcl
Initializing the backend...
Initializing modules...
Initializing provider plugins...
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Using previously-installed integrations/github v6.3.1
- Using previously-installed hashicorp/null v3.2.3

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
1063347
57353172
Success! The configuration is valid.

github_repository.terraform_operations: Preparing import... [id=github-terraform-examples]
github_repository.terraform_operations: Refreshing state... [id=github-terraform-examples]
github_repository.terraform_state_files: Preparing import... [id=terraform-state-files]
github_repository.terraform_state_files: Refreshing state... [id=terraform-state-files]
module.security.data.github_user.this["Rindrics"]: Reading...
module.security.data.github_user.this["Rindrics"]: Read complete after 1s [id=14845847]
github_membership.org_owner["Rindrics"]: Preparing import... [id=rindrics-sandbox-org:Rindrics]
github_membership.org_owner["Rindrics"]: Refreshing state... [id=rindrics-sandbox-org:Rindrics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.org_owner["Rindrics"] will be imported
    resource "github_membership" "org_owner" {
        etag     = "W/\"766b21bb57caf9f2c1b112732e1fbecde62decb89d2117fd1c76beafd82e12cf\""
        id       = "rindrics-sandbox-org:Rindrics"
        role     = "admin"
        username = "Rindrics"
    }

  # github_repository.all_in_one["bar"] will be created
  + resource "github_repository" "all_in_one" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "bar"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.all_in_one["baz"] will be created
  + resource "github_repository" "all_in_one" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "baz"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.all_in_one["foo"] will be created
  + resource "github_repository" "all_in_one" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "foo"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.terraform_operations will be updated in-place
  # (imported from "github-terraform-examples")
  ~ resource "github_repository" "terraform_operations" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Organization 配下のリソースを管理する Terraform ソースの置き場所"
        etag                        = "W/\"bffb0a6897fb44bda03326d730fafa92f300e3c7ff7ce0e6dcad51becbdca93e\""
      ~ full_name                   = "rindrics-sandbox-org/terraform-operations" -> (known after apply)
        git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-operations.git"
        has_discussions             = false
        has_downloads               = false
        has_issues                  = true
        has_projects                = false
        has_wiki                    = false
        homepage_url                = null
        html_url                    = "https://github.com/rindrics-sandbox-org/terraform-operations"
        http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-operations.git"
        id                          = "github-terraform-examples"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
      ~ name                        = "github-terraform-examples" -> "terraform-operations"
        node_id                     = "R_kgDONRuOGQ"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 890998297
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-operations.git"
        svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-operations"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.terraform_state_files will be imported
    resource "github_repository" "terraform_state_files" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = false
        description                 = "リポジトリ `github-operations` の GitHub Actions から利用される Terraform state file を保管する"
        etag                        = "W/\"4805ada61d6d2694496dc8e3b68c2111c1f16e6db254e6ed8f7f0dd62eaa5379\""
        full_name                   = "rindrics-sandbox-org/terraform-state-files"
        git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-state-files.git"
        has_discussions             = false
        has_downloads               = false
        has_issues                  = false
        has_projects                = false
        has_wiki                    = false
        homepage_url                = null
        html_url                    = "https://github.com/rindrics-sandbox-org/terraform-state-files"
        http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-state-files.git"
        id                          = "terraform-state-files"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-state-files"
        node_id                     = "R_kgDONRu-jA"
        primary_language            = null
        private                     = true
        repo_id                     = 891010700
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-state-files.git"
        svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-state-files"
        topics                      = []
        visibility                  = "private"
        vulnerability_alerts        = true
        web_commit_signoff_required = false
    }

  # github_team.all_in_one["team-1"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-1"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-2"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-2"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-3"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-3"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-4"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-4"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-5"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-5"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.all_in_one["team-1"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-1"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-2"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-2"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-3"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-3"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-4"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-4"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-5"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-5"
      + username = "Rindrics"
    }

  # github_team_repository.all_in_one["team-1:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-2:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-2:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-3:bar"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "bar"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-3:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-3:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-4:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-5:bar"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "bar"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-5:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-5:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

Plan: 3 to import, 23 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: .terraform/terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply ".terraform/terraform.plan"
github_repository.terraform_state_files: Importing... [id=terraform-state-files]
github_repository.terraform_state_files: Import complete [id=terraform-state-files]
github_repository.terraform_operations: Importing... [id=github-terraform-examples]
github_repository.terraform_operations: Import complete [id=github-terraform-examples]
github_membership.org_owner["Rindrics"]: Importing... [id=rindrics-sandbox-org:Rindrics]
github_membership.org_owner["Rindrics"]: Import complete [id=rindrics-sandbox-org:Rindrics]
github_team.all_in_one["team-3"]: Creating...
github_team.all_in_one["team-5"]: Creating...
github_repository.all_in_one["foo"]: Creating...
github_repository.all_in_one["bar"]: Creating...
github_team.all_in_one["team-2"]: Creating...
github_team.all_in_one["team-1"]: Creating...
github_team.all_in_one["team-4"]: Creating...
github_repository.all_in_one["baz"]: Creating...
github_repository.terraform_operations: Modifying... [id=github-terraform-examples]
github_team.all_in_one["team-5"]: Still creating... [10s elapsed]
github_team.all_in_one["team-3"]: Still creating... [10s elapsed]
github_repository.all_in_one["bar"]: Still creating... [10s elapsed]
github_repository.all_in_one["foo"]: Still creating... [10s elapsed]
github_team.all_in_one["team-1"]: Still creating... [10s elapsed]
github_team.all_in_one["team-2"]: Still creating... [10s elapsed]
github_team.all_in_one["team-4"]: Still creating... [10s elapsed]
github_repository.all_in_one["baz"]: Still creating... [10s elapsed]
github_repository.terraform_operations: Still modifying... [id=github-terraform-examples, 10s elapsed]
github_team.all_in_one["team-3"]: Still creating... [20s elapsed]
github_team.all_in_one["team-5"]: Still creating... [20s elapsed]
github_repository.all_in_one["foo"]: Still creating... [20s elapsed]
github_repository.all_in_one["bar"]: Still creating... [20s elapsed]
github_team.all_in_one["team-2"]: Still creating... [20s elapsed]
github_team.all_in_one["team-1"]: Still creating... [20s elapsed]
github_repository.all_in_one["baz"]: Still creating... [20s elapsed]
github_team.all_in_one["team-4"]: Still creating... [20s elapsed]
github_repository.terraform_operations: Still modifying... [id=github-terraform-examples, 20s elapsed]
github_team.all_in_one["team-5"]: Creation complete after 25s [id=11597544]
github_team.all_in_one["team-3"]: Creation complete after 25s [id=11597545]
github_team.all_in_one["team-2"]: Creation complete after 26s [id=11597546]
github_team.all_in_one["team-4"]: Creation complete after 28s [id=11597547]
github_team.all_in_one["team-1"]: Creation complete after 28s [id=11597548]
github_team_membership.all_in_one["team-2"]: Creating...
github_team_membership.all_in_one["team-4"]: Creating...
github_team_membership.all_in_one["team-3"]: Creating...
github_team_membership.all_in_one["team-1"]: Creating...
github_team_membership.all_in_one["team-5"]: Creating...
github_repository.terraform_operations: Modifications complete after 30s [id=terraform-operations]
github_repository.all_in_one["foo"]: Creation complete after 30s [id=foo]
github_repository.all_in_one["baz"]: Creation complete after 30s [id=baz]
github_repository.all_in_one["bar"]: Creation complete after 30s [id=bar]
github_team_repository.all_in_one["team-3:foo"]: Creating...
github_team_repository.all_in_one["team-2:baz"]: Creating...
github_team_repository.all_in_one["team-2:foo"]: Creating...
github_team_repository.all_in_one["team-3:bar"]: Creating...
github_team_repository.all_in_one["team-5:bar"]: Creating...
github_team_membership.all_in_one["team-1"]: Still creating... [10s elapsed]
github_team_membership.all_in_one["team-3"]: Still creating... [10s elapsed]
github_team_membership.all_in_one["team-2"]: Still creating... [10s elapsed]
github_team_membership.all_in_one["team-4"]: Still creating... [10s elapsed]
github_team_membership.all_in_one["team-5"]: Still creating... [10s elapsed]
github_team_repository.all_in_one["team-3:bar"]: Still creating... [10s elapsed]
github_team_repository.all_in_one["team-2:foo"]: Still creating... [10s elapsed]
github_team_repository.all_in_one["team-3:foo"]: Still creating... [10s elapsed]
github_team_repository.all_in_one["team-2:baz"]: Still creating... [10s elapsed]
github_team_repository.all_in_one["team-5:bar"]: Still creating... [10s elapsed]
github_team_repository.all_in_one["team-2:baz"]: Creation complete after 13s [id=11597546:baz]
github_team_repository.all_in_one["team-5:baz"]: Creating...
github_team_repository.all_in_one["team-2:foo"]: Creation complete after 13s [id=11597546:foo]
github_team_repository.all_in_one["team-3:baz"]: Creating...
github_team_repository.all_in_one["team-3:foo"]: Creation complete after 13s [id=11597545:foo]
github_team_repository.all_in_one["team-4:baz"]: Creating...
github_team_repository.all_in_one["team-3:bar"]: Creation complete after 13s [id=11597545:bar]
github_team_repository.all_in_one["team-1:foo"]: Creating...
github_team_repository.all_in_one["team-5:bar"]: Creation complete after 14s [id=11597544:bar]
github_team_repository.all_in_one["team-5:foo"]: Creating...
github_team_membership.all_in_one["team-2"]: Creation complete after 16s [id=team-2:Rindrics]
github_team_membership.all_in_one["team-3"]: Creation complete after 16s [id=team-3:Rindrics]
github_team_membership.all_in_one["team-4"]: Creation complete after 16s [id=team-4:Rindrics]
github_team_membership.all_in_one["team-1"]: Creation complete after 16s [id=team-1:Rindrics]
github_team_membership.all_in_one["team-5"]: Creation complete after 16s [id=team-5:Rindrics]
github_team_repository.all_in_one["team-5:baz"]: Creation complete after 8s [id=11597544:baz]
github_team_repository.all_in_one["team-3:baz"]: Creation complete after 8s [id=11597545:baz]
github_team_repository.all_in_one["team-4:baz"]: Creation complete after 8s [id=11597547:baz]
github_team_repository.all_in_one["team-1:foo"]: Creation complete after 8s [id=11597548:foo]
github_team_repository.all_in_one["team-5:foo"]: Creation complete after 7s [id=11597544:foo]

Apply complete! Resources: 3 imported, 23 added, 1 changed, 0 destroyed.

```

</details>



<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":6,"Program":"tfcmt","SHA1":"812980d6b7dc9da586ffcd1d5c905489b88c49d7","Vars":{},"WorkflowName":"terraform-apply"} -->